# StructuralSectionCommonElasticModulusWeakAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionCommonElasticModulusWeakAxis Property
ParameterTypeId Class See Also
---
"Elastic Modulus weak axis"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionCommonElasticModulusWeakAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionCommonElasticModulusWeakAxis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionCommonElasticModulusWeakAxis {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace